#include <stdio.h>

int main_MA(void)
{
    // 다차원 배열
    // int arr[5]; // 5개 공간
    // ㅁㅁㅁㅁㅁ
    //[0][1][2][3][4]

    // int arr2[2][5]; // 10개 공간
    // ㅁㅁㅁㅁㅁ
    // ㅁㅁㅁㅁㅁ
    //[0,0][0,1][0,2][0,3][0,4]  ex) arr2[0][2]
    //[1,0][1,1][1,2][1,3][1,4]  ex) arr2[1][4]

    // int arr3[4][2]; // 8개 공간
    // ㅁㅁ
    // ㅁㅁ
    // ㅁㅁ
    // ㅁㅁ

    // int arr4[3][2][3]; // 18개 공간
    // ㅁㅁㅁ   [0.0.0][0.0.1][0.0.2]
    // ㅁㅁㅁ   [0.1.0][0.1.1][0.1.2]

    // ㅁㅁㅁ   [1.0.0][1.0.1][1.0.2]
    // ㅁㅁㅁ   [1.1.0][1.1.1][1.1.2]

    // ㅁㅁㅁ   [2.0.0][2.0.1][2.0.2]
    // ㅁㅁㅁ   [2.1.0][2.1.1][2.1.2]

    // int arr[5] = {1, 2, 3, 4, 5};
    int arr2[2][5] = {
        {1, 2, 3, 4, 5}, 
        {1, 2, 3, 4, 5}
    };
    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 5; j++)
        {
            printf("2차원배열(%d, %d)의 값 : %d\n", i, j, arr2[i][j]);
        }
    }
    
    int arr3[3][2][3] = {
        {
            {3, 2, 3},
            {3, 2, 3}
        },
        {
            {3, 2, 3},
            {3, 2, 3}
        },
        {
            {3, 2, 3},
            {3, 2, 3}
        }
    };
    for (int i = 0; i < 3; i++)
    {
        for (int j = 0; j < 2; j++)
        {
            for (int k = 0; k < 3; k++)
            {
                printf("3차원배열(%d, %d, %d)의 값 : %d\n", i, j, k, arr3[i][j][k]);

            }
        }
    }

    return 0;
}